espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/jpeg_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Control and configuration registers */
/** Type of config register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** fsm_rst : WT; bitpos: [0]; default: 0;
         *  fsm reset
         */
        uint32_t fsm_rst:1;
        /** jpeg_start : WT; bitpos: [1]; default: 0;
         *  start to compress a new pic(in dma reg mode)
         */
        uint32_t jpeg_start:1;
        /** qnr_presition : R/W; bitpos: [2]; default: 0;
         *  0:8bit qnr,1:12bit qnr(TBD)
         */
        uint32_t qnr_presition:1;
        /** ff_check_en : R/W; bitpos: [3]; default: 1;
         *  enable whether to add "00" after "ff"
         */
        uint32_t ff_check_en:1;
        /** sample_sel : R/W; bitpos: [5:4]; default: 1;
         *  0:yuv444,1:yuv422, 2:yuv420
         */
        uint32_t sample_sel:2;
        /** dma_linklist_mode : RO; bitpos: [6]; default: 1;
         *  1:use linklist to configure dma
         */
        uint32_t dma_linklist_mode:1;
        /** debug_direct_out_en : R/W; bitpos: [7]; default: 0;
         *  0:normal mode,1:debug mode for direct output from input
         */
        uint32_t debug_direct_out_en:1;
        /** qnr_fifo_en : R/W; bitpos: [8]; default: 1;
         *  0:use non-fifo way to access qnr ram,1:use fifo way to access qnr ram
         */
        uint32_t qnr_fifo_en:1;
        /** lqnr_tbl_sel : R/W; bitpos: [10:9]; default: 0;
         *  choose  luminance quntization table id(TBD)
         */
        uint32_t lqnr_tbl_sel:2;
        /** cqnr_tbl_sel : R/W; bitpos: [12:11]; default: 1;
         *  choose  chrominance quntization table id (TBD)
         */
        uint32_t cqnr_tbl_sel:2;
        /** color_space : R/W; bitpos: [14:13]; default: 0;
         *  configure picture's color space:0-rb888,1-yuv422,2-rgb565, 3-gray
         */
        uint32_t color_space:2;
        /** dht_fifo_en : R/W; bitpos: [15]; default: 1;
         *  0:use non-fifo way to write dht len_total/codemin/value table,1:use fifo way to
         *  write dht len_total/codemin/value table. Reading dht len_total/codemin/value table
         *  only has nonfifo way
         */
        uint32_t dht_fifo_en:1;
        /** mem_clk_force_on : R/W; bitpos: [16]; default: 0;
         *  force memory's clock enabled
         */
        uint32_t mem_clk_force_on:1;
        /** jfif_ver : R/W; bitpos: [22:17]; default: 32;
         *  decode pause period to trigger decode_timeout int, the timeout periods =2 power
         *  (reg_decode_timeout_thres) -1
         */
        uint32_t jfif_ver:6;
        /** decode_timeout_task_sel : R/W; bitpos: [23]; default: 0;
         *  0: software use reset to abort decode process ,1: decoder abort decode process by
         *  itself
         */
        uint32_t decode_timeout_task_sel:1;
        /** soft_rst : R/W; bitpos: [24]; default: 0;
         *  when set to 1, soft reset JPEG module except jpeg_reg module
         */
        uint32_t soft_rst:1;
        /** fifo_rst : R/W; bitpos: [25]; default: 0;
         *  fifo reset
         */
        uint32_t fifo_rst:1;
        /** pixel_rev : R/W; bitpos: [26]; default: 0;
         *  reverse the source color pixel
         */
        uint32_t pixel_rev:1;
        /** tailer_en : R/W; bitpos: [27]; default: 0;
         *  set this bit to add EOI of "0xffd9" at the end of bitstream
         */
        uint32_t tailer_en:1;
        /** pause_en : R/W; bitpos: [28]; default: 0;
         *  set this bit to pause jpeg encoding
         */
        uint32_t pause_en:1;
        /** mem_force_pd : R/W; bitpos: [29]; default: 0;
         *  0: no operation,1:force jpeg memory to power down
         */
        uint32_t mem_force_pd:1;
        /** mem_force_pu : R/W; bitpos: [30]; default: 0;
         *  0: no operation,1:force jpeg memory to power up
         */
        uint32_t mem_force_pu:1;
        /** mode : R/W; bitpos: [31]; default: 0;
         *  0:encoder mode, 1: decoder mode
         */
        uint32_t mode:1;
    };
    uint32_t val;
} jpeg_config_reg_t;

/** Type of dqt_info register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** t0_dqt_info : R/W; bitpos: [7:0]; default: 0;
         *  Configure dqt table0's quantization coefficient precision in bit[7:4], configure
         *  dqt table0's table id in bit[3:0]
         */
        uint32_t t0_dqt_info:8;
        /** t1_dqt_info : R/W; bitpos: [15:8]; default: 1;
         *  Configure dqt table1's quantization coefficient precision in bit[7:4], configure
         *  dqt table1's table id in bit[3:0]
         */
        uint32_t t1_dqt_info:8;
        /** t2_dqt_info : R/W; bitpos: [23:16]; default: 2;
         *  Configure dqt table2's quantization coefficient precision in bit[7:4], configure
         *  dqt table2's table id in bit[3:0]
         */
        uint32_t t2_dqt_info:8;
        /** t3_dqt_info : R/W; bitpos: [31:24]; default: 3;
         *  Configure dqt table3's quantization coefficient precision in bit[7:4], configure
         *  dqt table3's table id in bit[3:0]
         */
        uint32_t t3_dqt_info:8;
    };
    uint32_t val;
} jpeg_dqt_info_reg_t;

/** Type of pic_size register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** va : R/W; bitpos: [15:0]; default: 480;
         *  configure picture's height. when encode, the max configurable bits is 14, when
         *  decode, the max configurable bits is 16
         */
        uint32_t va:16;
        /** ha : R/W; bitpos: [31:16]; default: 640;
         *  configure picture's width. when encode, the max configurable bits is 14, when
         *  decode, the max configurable bits is 16
         */
        uint32_t ha:16;
    };
    uint32_t val;
} jpeg_pic_size_reg_t;

