espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/jpeg_struct.h
/** Type of int_st register
 *  Interrupt status registers
 */
typedef union {
    struct {
        /** done_int_st : RO; bitpos: [0]; default: 0;
         *  This status interrupt bit turns to high level when JPEG finishes encoding a
         *  picture..
         */
        uint32_t done_int_st:1;
        /** rle_parallel_err_int_st : RO; bitpos: [1]; default: 0;
         *  The status interrupt bit to sign that rle parallel error when decoding.
         */
        uint32_t rle_parallel_err_int_st:1;
        /** cid_err_int_st : RO; bitpos: [2]; default: 0;
         *  The status interrupt bit to sign that scan id check with component fails when
         *  decoding.
         */
        uint32_t cid_err_int_st:1;
        /** c_dht_dc_id_err_int_st : RO; bitpos: [3]; default: 0;
         *  The status interrupt bit to sign that scan component's dc dht id check with dc dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_dc_id_err_int_st:1;
        /** c_dht_ac_id_err_int_st : RO; bitpos: [4]; default: 0;
         *  The status interrupt bit to sign that scan component's ac dht id check with ac dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_ac_id_err_int_st:1;
        /** c_dqt_id_err_int_st : RO; bitpos: [5]; default: 0;
         *  The status interrupt bit to sign that scan component's dqt id check with dqt
         *  table's id fails when decoding.
         */
        uint32_t c_dqt_id_err_int_st:1;
        /** rst_uxp_err_int_st : RO; bitpos: [6]; default: 0;
         *  The status interrupt bit to sign that RST header marker is detected but restart
         *  interval is 0 when decoding.
         */
        uint32_t rst_uxp_err_int_st:1;
        /** rst_check_none_err_int_st : RO; bitpos: [7]; default: 0;
         *  The status interrupt bit to sign that RST header marker is not detected but restart
         *  interval is not 0 when decoding.
         */
        uint32_t rst_check_none_err_int_st:1;
        /** rst_check_pos_err_int_st : RO; bitpos: [8]; default: 0;
         *  The status interrupt bit to sign that RST header marker position mismatches with
         *  restart interval when decoding.
         */
        uint32_t rst_check_pos_err_int_st:1;
        /** out_eof_int_st : RO; bitpos: [9]; default: 0;
         *  The status interrupt bit turns to high level when the last pixel of one square has
         *  been transmitted for Tx channel.
         */
        uint32_t out_eof_int_st:1;
        /** sr_color_mode_err_int_st : RO; bitpos: [10]; default: 0;
         *  The status interrupt bit to sign that the selected source color mode is not
         *  supported.
         */
        uint32_t sr_color_mode_err_int_st:1;
        /** dct_done_int_st : RO; bitpos: [11]; default: 0;
         *  The status interrupt bit to sign that one dct calculation is finished.
         */
        uint32_t dct_done_int_st:1;
        /** bs_last_block_eof_int_st : RO; bitpos: [12]; default: 0;
         *  The status interrupt bit to sign that the coding process for last block is finished.
         */
        uint32_t bs_last_block_eof_int_st:1;
        /** scan_check_none_err_int_st : RO; bitpos: [13]; default: 0;
         *  The status interrupt bit to sign that SOS header marker is not detected but there
         *  are still components left to be decoded.
         */
        uint32_t scan_check_none_err_int_st:1;
        /** scan_check_pos_err_int_st : RO; bitpos: [14]; default: 0;
         *  The status interrupt bit to sign that SOS header marker position wrong when
         *  decoding.
         */
        uint32_t scan_check_pos_err_int_st:1;
        /** uxp_det_int_st : RO; bitpos: [15]; default: 0;
         *  The status interrupt bit to sign that unsupported header marker is detected when
         *  decoding.
         */
        uint32_t uxp_det_int_st:1;
        /** en_frame_eof_err_int_st : RO; bitpos: [16]; default: 0;
         *  The status interrupt bit to sign that received pixel blocks are smaller than
         *  expected when encoding.
         */
        uint32_t en_frame_eof_err_int_st:1;
        /** en_frame_eof_lack_int_st : RO; bitpos: [17]; default: 0;
         *  The status interrupt bit to sign that the frame eof sign bit from dma input is
         *  missing when encoding. But the number of pixel blocks is enough.
         */
        uint32_t en_frame_eof_lack_int_st:1;
        /** de_frame_eof_err_int_st : RO; bitpos: [18]; default: 0;
         *  The status interrupt bit to sign that decoded blocks are smaller than expected when
         *  decoding.
         */
        uint32_t de_frame_eof_err_int_st:1;
        /** de_frame_eof_lack_int_st : RO; bitpos: [19]; default: 0;
         *  The status interrupt bit to sign that the either frame eof from dma input or eoi
         *  marker is missing when encoding. But the number of decoded blocks is enough.
         */
        uint32_t de_frame_eof_lack_int_st:1;
        /** sos_unmatch_err_int_st : RO; bitpos: [20]; default: 0;
         *  The status interrupt bit to sign that the component number of a scan is 0 or does
         *  not match the sos marker's length when decoding.
         */
        uint32_t sos_unmatch_err_int_st:1;
        /** marker_err_fst_scan_int_st : RO; bitpos: [21]; default: 0;
         *  The status interrupt bit to sign that the first scan has header marker error when
         *  decoding.
         */
        uint32_t marker_err_fst_scan_int_st:1;
        /** marker_err_other_scan_int_st : RO; bitpos: [22]; default: 0;
         *  The status interrupt bit to sign that the following scans but not the first scan
         *  have header marker error when decoding.
         */
        uint32_t marker_err_other_scan_int_st:1;
        /** undet_int_st : RO; bitpos: [23]; default: 0;
         *  The status interrupt bit to sign that JPEG format is not detected at the eof data
         *  of a packet when decoding.
         */
        uint32_t undet_int_st:1;
        /** decode_timeout_int_st : RO; bitpos: [24]; default: 0;
         *  The status interrupt bit to sign that decode pause time is longer than the setting
         *  decode timeout time when decoding.
         */
        uint32_t decode_timeout_int_st:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} jpeg_int_st_reg_t;

/** Type of int_clr register
 *  Interrupt clear registers
 */
typedef union {
    struct {
        /** done_int_clr : WT; bitpos: [0]; default: 0;
         *  This clear interrupt bit turns to high level when JPEG finishes encoding a picture..
         */
        uint32_t done_int_clr:1;
        /** rle_parallel_err_int_clr : WT; bitpos: [1]; default: 0;
         *  The clear interrupt bit to sign that rle parallel error when decoding.
         */
        uint32_t rle_parallel_err_int_clr:1;
        /** cid_err_int_clr : WT; bitpos: [2]; default: 0;
         *  The clear interrupt bit to sign that scan id check with component fails when
         *  decoding.
         */
        uint32_t cid_err_int_clr:1;
        /** c_dht_dc_id_err_int_clr : WT; bitpos: [3]; default: 0;
         *  The clear interrupt bit to sign that scan component's dc dht id check with dc dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_dc_id_err_int_clr:1;
        /** c_dht_ac_id_err_int_clr : WT; bitpos: [4]; default: 0;
         *  The clear interrupt bit to sign that scan component's ac dht id check with ac dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_ac_id_err_int_clr:1;
        /** c_dqt_id_err_int_clr : WT; bitpos: [5]; default: 0;
         *  The clear interrupt bit to sign that scan component's dqt id check with dqt table's
         *  id fails when decoding.
         */
        uint32_t c_dqt_id_err_int_clr:1;
        /** rst_uxp_err_int_clr : WT; bitpos: [6]; default: 0;
         *  The clear interrupt bit to sign that RST header marker is detected but restart
         *  interval is 0 when decoding.
         */
        uint32_t rst_uxp_err_int_clr:1;
        /** rst_check_none_err_int_clr : WT; bitpos: [7]; default: 0;
         *  The clear interrupt bit to sign that RST header marker is not detected but restart
         *  interval is not 0 when decoding.
         */
        uint32_t rst_check_none_err_int_clr:1;
        /** rst_check_pos_err_int_clr : WT; bitpos: [8]; default: 0;
         *  The clear interrupt bit to sign that RST header marker position mismatches with
         *  restart interval when decoding.
         */
        uint32_t rst_check_pos_err_int_clr:1;
        /** out_eof_int_clr : WT; bitpos: [9]; default: 0;
         *  The clear interrupt bit turns to high level when the last pixel of one square has
         *  been transmitted for Tx channel.
         */
        uint32_t out_eof_int_clr:1;
        /** sr_color_mode_err_int_clr : WT; bitpos: [10]; default: 0;
         *  The clear interrupt bit to sign that the selected source color mode is not
         *  supported.
         */
        uint32_t sr_color_mode_err_int_clr:1;
        /** dct_done_int_clr : WT; bitpos: [11]; default: 0;
         *  The clear interrupt bit to sign that one dct calculation is finished.
         */
        uint32_t dct_done_int_clr:1;
        /** bs_last_block_eof_int_clr : WT; bitpos: [12]; default: 0;
         *  The clear interrupt bit to sign that the coding process for last block is finished.
         */
        uint32_t bs_last_block_eof_int_clr:1;
        /** scan_check_none_err_int_clr : WT; bitpos: [13]; default: 0;
         *  The clear interrupt bit to sign that SOS header marker is not detected but there
         *  are still components left to be decoded.
         */
        uint32_t scan_check_none_err_int_clr:1;
        /** scan_check_pos_err_int_clr : WT; bitpos: [14]; default: 0;
         *  The clear interrupt bit to sign that SOS header marker position wrong when decoding.
         */
        uint32_t scan_check_pos_err_int_clr:1;
        /** uxp_det_int_clr : WT; bitpos: [15]; default: 0;
         *  The clear interrupt bit to sign that unsupported header marker is detected when
         *  decoding.
         */
        uint32_t uxp_det_int_clr:1;
        /** en_frame_eof_err_int_clr : WT; bitpos: [16]; default: 0;
         *  The clear interrupt bit to sign that received pixel blocks are smaller than
         *  expected when encoding.
         */
        uint32_t en_frame_eof_err_int_clr:1;
        /** en_frame_eof_lack_int_clr : WT; bitpos: [17]; default: 0;
         *  The clear interrupt bit to sign that the frame eof sign bit from dma input is
         *  missing when encoding. But the number of pixel blocks is enough.
         */
        uint32_t en_frame_eof_lack_int_clr:1;
        /** de_frame_eof_err_int_clr : WT; bitpos: [18]; default: 0;
         *  The clear interrupt bit to sign that decoded blocks are smaller than expected when
         *  decoding.
         */
        uint32_t de_frame_eof_err_int_clr:1;
        /** de_frame_eof_lack_int_clr : WT; bitpos: [19]; default: 0;
         *  The clear interrupt bit to sign that the either frame eof from dma input or eoi
         *  marker is missing when encoding. But the number of decoded blocks is enough.
         */
        uint32_t de_frame_eof_lack_int_clr:1;
        /** sos_unmatch_err_int_clr : WT; bitpos: [20]; default: 0;
         *  The clear interrupt bit to sign that the component number of a scan is 0 or does
         *  not match the sos marker's length when decoding.
         */
        uint32_t sos_unmatch_err_int_clr:1;
        /** marker_err_fst_scan_int_clr : WT; bitpos: [21]; default: 0;
         *  The clear interrupt bit to sign that the first scan has header marker error when
         *  decoding.
         */
        uint32_t marker_err_fst_scan_int_clr:1;
        /** marker_err_other_scan_int_clr : WT; bitpos: [22]; default: 0;
         *  The clear interrupt bit to sign that the following scans but not the first scan
         *  have header marker error when decoding.
         */
        uint32_t marker_err_other_scan_int_clr:1;
        /** undet_int_clr : WT; bitpos: [23]; default: 0;
         *  The clear interrupt bit to sign that JPEG format is not detected at the eof data of
         *  a packet when decoding.
         */
        uint32_t undet_int_clr:1;
        /** decode_timeout_int_clr : WT; bitpos: [24]; default: 0;
         *  The clear interrupt bit to sign that decode pause time is longer than the setting
         *  decode timeout time when decoding.
         */
        uint32_t decode_timeout_int_clr:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} jpeg_int_clr_reg_t;


