espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/jpeg_struct.h
/** Group: Trace and Debug registers */
/** Type of status0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        uint32_t reserved_0:11;
        /** bitstream_eof_vld_cnt : RO; bitpos: [16:11]; default: 0;
         *  the valid bit count for last bitstream
         */
        uint32_t bitstream_eof_vld_cnt:6;
        /** dctout_zzscan_addr : RO; bitpos: [22:17]; default: 0;
         *  the zig-zag read addr from dctout_ram
         */
        uint32_t dctout_zzscan_addr:6;
        /** qnrval_zzscan_addr : RO; bitpos: [28:23]; default: 0;
         *  the zig-zag read addr from qnrval_ram
         */
        uint32_t qnrval_zzscan_addr:6;
        /** reg_state_yuv : RO; bitpos: [31:29]; default: 0;
         *  the state of jpeg fsm
         */
        uint32_t reg_state_yuv:3;
    };
    uint32_t val;
} jpeg_status0_reg_t;

/** Type of status2 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** source_pixel : RO; bitpos: [23:0]; default: 0;
         *  source pixels fetched from dma
         */
        uint32_t source_pixel:24;
        /** last_block : RO; bitpos: [24]; default: 0;
         *  indicate the encoding process for the last mcu of the picture
         */
        uint32_t last_block:1;
        /** last_mcu : RO; bitpos: [25]; default: 0;
         *  indicate the encoding process for the last block of the picture
         */
        uint32_t last_mcu:1;
        /** last_dc : RO; bitpos: [26]; default: 0;
         *  indicate the encoding process is at the header of the last block of the picture
         */
        uint32_t last_dc:1;
        /** packfifo_ready : RO; bitpos: [27]; default: 1;
         *  the jpeg pack_fifo ready signal, high active
         */
        uint32_t packfifo_ready:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} jpeg_status2_reg_t;

/** Type of status3 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** yo : RO; bitpos: [8:0]; default: 0;
         *  component y transferred from rgb input
         */
        uint32_t yo:9;
        /** y_ready : RO; bitpos: [9]; default: 0;
         *  component y valid signal, high active
         */
        uint32_t y_ready:1;
        /** cbo : RO; bitpos: [18:10]; default: 0;
         *  component cb transferred from rgb input
         */
        uint32_t cbo:9;
        /** cb_ready : RO; bitpos: [19]; default: 0;
         *  component cb valid signal, high active
         */
        uint32_t cb_ready:1;
        /** cro : RO; bitpos: [28:20]; default: 0;
         *  component cr transferred from rgb input
         */
        uint32_t cro:9;
        /** cr_ready : RO; bitpos: [29]; default: 0;
         *  component cr valid signal, high active
         */
        uint32_t cr_ready:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} jpeg_status3_reg_t;

/** Type of status4 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** hfm_bitstream : RO; bitpos: [31:0]; default: 0;
         *  the hufman bitstream during encoding process
         */
        uint32_t hfm_bitstream:32;
    };
    uint32_t val;
} jpeg_status4_reg_t;

/** Type of dht_totlen_dc0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_totlen_dc0 : HRO; bitpos: [31:0]; default: 0;
         *  write the numbers of 1~n codeword length sum from 1~16 of dc0 table
         */
        uint32_t dht_totlen_dc0:32;
    };
    uint32_t val;
} jpeg_dht_totlen_dc0_reg_t;

/** Type of dht_val_dc0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_val_dc0 : HRO; bitpos: [31:0]; default: 0;
         *  write codeword corresponding huffman values of dc0 table
         */
        uint32_t dht_val_dc0:32;
    };
    uint32_t val;
} jpeg_dht_val_dc0_reg_t;

/** Type of dht_totlen_ac0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_totlen_ac0 : HRO; bitpos: [31:0]; default: 0;
         *  write the numbers of 1~n codeword length sum from 1~16 of ac0 table
         */
        uint32_t dht_totlen_ac0:32;
    };
    uint32_t val;
} jpeg_dht_totlen_ac0_reg_t;

/** Type of dht_val_ac0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_val_ac0 : HRO; bitpos: [31:0]; default: 0;
         *  write codeword corresponding huffman values of ac0 table
         */
        uint32_t dht_val_ac0:32;
    };
    uint32_t val;
} jpeg_dht_val_ac0_reg_t;

/** Type of dht_totlen_dc1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_totlen_dc1 : HRO; bitpos: [31:0]; default: 0;
         *  write the numbers of 1~n codeword length sum from 1~16 of dc1 table
         */
        uint32_t dht_totlen_dc1:32;
    };
    uint32_t val;
} jpeg_dht_totlen_dc1_reg_t;

/** Type of dht_val_dc1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_val_dc1 : HRO; bitpos: [31:0]; default: 0;
         *  write codeword corresponding huffman values of dc1 table
         */
        uint32_t dht_val_dc1:32;
    };
    uint32_t val;
} jpeg_dht_val_dc1_reg_t;

/** Type of dht_totlen_ac1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_totlen_ac1 : HRO; bitpos: [31:0]; default: 0;
         *  write the numbers of 1~n codeword length sum from 1~16 of ac1 table
         */
        uint32_t dht_totlen_ac1:32;
    };
    uint32_t val;
} jpeg_dht_totlen_ac1_reg_t;

/** Type of dht_val_ac1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_val_ac1 : HRO; bitpos: [31:0]; default: 0;
         *  write codeword corresponding huffman values of ac1 table
         */
        uint32_t dht_val_ac1:32;
    };
    uint32_t val;
} jpeg_dht_val_ac1_reg_t;

/** Type of dht_codemin_dc0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_codemin_dc0 : HRO; bitpos: [31:0]; default: 0;
         *  write the minimum codeword of  code length from 1~16 of dc0 table. The codeword is
         *  left shifted to the MSB position of a 16bit word
         */
        uint32_t dht_codemin_dc0:32;
    };
    uint32_t val;
} jpeg_dht_codemin_dc0_reg_t;

/** Type of dht_codemin_ac0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_codemin_ac0 : HRO; bitpos: [31:0]; default: 0;
         *  write the minimum codeword of  code length from 1~16 of ac0 table. The codeword is
         *  left shifted to the MSB position of a 16bit word
         */
        uint32_t dht_codemin_ac0:32;
    };
    uint32_t val;
} jpeg_dht_codemin_ac0_reg_t;

