espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/jpeg_struct.h
/** Type of dht_codemin_dc1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_codemin_dc1 : HRO; bitpos: [31:0]; default: 0;
         *  write the minimum codeword of  code length from 1~16 of dc1 table. The codeword is
         *  left shifted to the MSB position of a 16bit word
         */
        uint32_t dht_codemin_dc1:32;
    };
    uint32_t val;
} jpeg_dht_codemin_dc1_reg_t;

/** Type of dht_codemin_ac1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** dht_codemin_ac1 : HRO; bitpos: [31:0]; default: 0;
         *  write the minimum codeword of  code length from 1~16 of ac1 table. The codeword is
         *  left shifted to the MSB position of a 16bit word
         */
        uint32_t dht_codemin_ac1:32;
    };
    uint32_t val;
} jpeg_dht_codemin_ac1_reg_t;

/** Type of decoder_status0 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** decode_byte_cnt : RO; bitpos: [25:0]; default: 0;
         *  Reserved
         */
        uint32_t decode_byte_cnt:26;
        /** header_dec_st : RO; bitpos: [29:26]; default: 0;
         *  Reserved
         */
        uint32_t header_dec_st:4;
        /** decode_sample_sel : RO; bitpos: [31:30]; default: 0;
         *  Reserved
         */
        uint32_t decode_sample_sel:2;
    };
    uint32_t val;
} jpeg_decoder_status0_reg_t;

/** Type of decoder_status1 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** encode_data : RO; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t encode_data:16;
        /** count_q : RO; bitpos: [22:16]; default: 0;
         *  Reserved
         */
        uint32_t count_q:7;
        /** mcu_fsm_ready : RO; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t mcu_fsm_ready:1;
        /** decode_data : RO; bitpos: [31:24]; default: 0;
         *  Reserved
         */
        uint32_t decode_data:8;
    };
    uint32_t val;
} jpeg_decoder_status1_reg_t;

/** Type of decoder_status2 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** comp_block_num : RO; bitpos: [25:0]; default: 0;
         *  Reserved
         */
        uint32_t comp_block_num:26;
        /** scan_num : RO; bitpos: [28:26]; default: 0;
         *  Reserved
         */
        uint32_t scan_num:3;
        /** rst_check_wait : RO; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t rst_check_wait:1;
        /** scan_check_wait : RO; bitpos: [30]; default: 0;
         *  Reserved
         */
        uint32_t scan_check_wait:1;
        /** mcu_in_proc : RO; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t mcu_in_proc:1;
    };
    uint32_t val;
} jpeg_decoder_status2_reg_t;

/** Type of decoder_status3 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** lookup_data : RO; bitpos: [31:0]; default: 0;
         *  Reserved
         */
        uint32_t lookup_data:32;
    };
    uint32_t val;
} jpeg_decoder_status3_reg_t;

/** Type of decoder_status4 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** block_eof_cnt : RO; bitpos: [25:0]; default: 0;
         *  Reserved
         */
        uint32_t block_eof_cnt:26;
        /** dezigzag_ready : RO; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t dezigzag_ready:1;
        /** de_frame_eof_check : RO; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t de_frame_eof_check:1;
        /** de_dma2d_in_push : RO; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t de_dma2d_in_push:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} jpeg_decoder_status4_reg_t;

/** Type of decoder_status5 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** idct_hfm_data : RO; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t idct_hfm_data:16;
        /** ns0 : RO; bitpos: [18:16]; default: 0;
         *  Reserved
         */
        uint32_t ns0:3;
        /** ns1 : RO; bitpos: [21:19]; default: 0;
         *  Reserved
         */
        uint32_t ns1:3;
        /** ns2 : RO; bitpos: [24:22]; default: 0;
         *  Reserved
         */
        uint32_t ns2:3;
        /** ns3 : RO; bitpos: [27:25]; default: 0;
         *  Reserved
         */
        uint32_t ns3:3;
        /** data_last_o : RO; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t data_last_o:1;
        /** rdn_result : RO; bitpos: [29]; default: 0;
         *  redundant registers for jpeg
         */
        uint32_t rdn_result:1;
        /** rdn_ena : R/W; bitpos: [30]; default: 0;
         *  redundant control registers for jpeg
         */
        uint32_t rdn_ena:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} jpeg_decoder_status5_reg_t;

/** Type of status5 register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** pic_block_num : RO; bitpos: [23:0]; default: 0;
         *  Reserved
         */
        uint32_t pic_block_num:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} jpeg_status5_reg_t;

/** Type of eco_low register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  redundant registers for jpeg
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} jpeg_eco_low_reg_t;

/** Type of eco_high register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  redundant registers for jpeg
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} jpeg_eco_high_reg_t;

/** Type of sys register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} jpeg_sys_reg_t;

/** Type of version register
 *  Trace and Debug registers
 */
typedef union {
    struct {
        /** jpeg_ver : R/W; bitpos: [27:0]; default: 34673040;
         *  Reserved
         */
        uint32_t jpeg_ver:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} jpeg_version_reg_t;


typedef struct jpeg_dev_t {
    volatile jpeg_config_reg_t config;
    volatile jpeg_dqt_info_reg_t dqt_info;
    volatile jpeg_pic_size_reg_t pic_size;
    uint32_t reserved_00c;
    volatile jpeg_t0qnr_reg_t t0qnr;
    volatile jpeg_t1qnr_reg_t t1qnr;
    volatile jpeg_t2qnr_reg_t t2qnr;
    volatile jpeg_t3qnr_reg_t t3qnr;
    volatile jpeg_decode_conf_reg_t decode_conf;
    volatile jpeg_c0_reg_t c0;
    volatile jpeg_c1_reg_t c1;
    volatile jpeg_c2_reg_t c2;
    volatile jpeg_c3_reg_t c3;
    volatile jpeg_dht_info_reg_t dht_info;
    volatile jpeg_int_raw_reg_t int_raw;
    volatile jpeg_int_ena_reg_t int_ena;
    volatile jpeg_int_st_reg_t int_st;
    volatile jpeg_int_clr_reg_t int_clr;
    volatile jpeg_status0_reg_t status0;
    volatile jpeg_status2_reg_t status2;
    volatile jpeg_status3_reg_t status3;
    volatile jpeg_status4_reg_t status4;
    volatile jpeg_dht_totlen_dc0_reg_t dht_totlen_dc0;
    volatile jpeg_dht_val_dc0_reg_t dht_val_dc0;
    volatile jpeg_dht_totlen_ac0_reg_t dht_totlen_ac0;
    volatile jpeg_dht_val_ac0_reg_t dht_val_ac0;
    volatile jpeg_dht_totlen_dc1_reg_t dht_totlen_dc1;
    volatile jpeg_dht_val_dc1_reg_t dht_val_dc1;
    volatile jpeg_dht_totlen_ac1_reg_t dht_totlen_ac1;
    volatile jpeg_dht_val_ac1_reg_t dht_val_ac1;
    volatile jpeg_dht_codemin_dc0_reg_t dht_codemin_dc0;
    volatile jpeg_dht_codemin_ac0_reg_t dht_codemin_ac0;
    volatile jpeg_dht_codemin_dc1_reg_t dht_codemin_dc1;
    volatile jpeg_dht_codemin_ac1_reg_t dht_codemin_ac1;
    volatile jpeg_decoder_status0_reg_t decoder_status0;
    volatile jpeg_decoder_status1_reg_t decoder_status1;
    volatile jpeg_decoder_status2_reg_t decoder_status2;
    volatile jpeg_decoder_status3_reg_t decoder_status3;
    volatile jpeg_decoder_status4_reg_t decoder_status4;
    volatile jpeg_decoder_status5_reg_t decoder_status5;
    volatile jpeg_status5_reg_t status5;
    volatile jpeg_eco_low_reg_t eco_low;
    volatile jpeg_eco_high_reg_t eco_high;
    uint32_t reserved_0ac[19];
    volatile jpeg_sys_reg_t sys;
    volatile jpeg_version_reg_t version;
} jpeg_dev_t;

extern jpeg_dev_t JPEG;

#ifndef __cplusplus
_Static_assert(sizeof(jpeg_dev_t) == 0x100, "Invalid size of jpeg_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
